<a href="https://colab.research.google.com/github/priyanshgupta1998/Machine_learning/blob/master/Krisko_Assignmnet/coding.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Krisko Assignment

In [0]:
import pandas as pd
data1 = pd.read_excel('Input-Rank-Cutoff-List.xlsx')
data1.to_csv('Train.csv')

In [3]:
print(data1.shape)

(295, 9)

In [4]:
column = []
for i in range(data1.shape[1]):
  column.append('col_'+ str(i))
data = pd.read_csv('Train.csv' , names= column)
print(data.shape)
data.head(5)

(296, 9)

                     col_0       col_1  ...       col_7       col_8
NaN             IIT Bombay  Unnamed: 1  ...  Unnamed: 7  Unnamed: 8
0.0           Branch Name     General   ...          ST         NaN
1.0                    NaN        Open  ...        Open       Close
2.0  Aerospace Engineering         405  ...         154         266
3.0   Chemical Engineering         727  ...         158         315

[5 rows x 9 columns]

In [5]:
data.reset_index(inplace=True)
data.head()

   index                  col_0       col_1  ...       col_6       col_7       col_8
0    NaN             IIT Bombay  Unnamed: 1  ...  Unnamed: 6  Unnamed: 7  Unnamed: 8
1    0.0           Branch Name     General   ...         NaN          ST         NaN
2    1.0                    NaN        Open  ...       Close        Open       Close
3    2.0  Aerospace Engineering         405  ...         334         154         266
4    3.0   Chemical Engineering         727  ...         544         158         315

[5 rows x 10 columns]

In [0]:
data.drop('index' , axis =1 , inplace =True)

#Get the Branch Name

In [7]:
app =[]
for i in list(data[data['col_0']=='Branch Name '].index):
  app.append(i-1)
print(len(app) , app)

17 [0, 21, 39, 82, 99, 133, 155, 171, 180, 188, 196, 208, 218, 227, 236, 244, 273]

In [8]:
collg = []
for i in app:
  collg.append(data['col_0'][i])
  
print(len(collg) , collg)

17 ['IIT Bombay', 'IIT Delhi', 'IIT Kharagpur', 'IIT Kanpur', 'IIT Madras', 'IIT Roorkee', 'IIT Guwahati', 'IIT Bhubaneshwar', 'IIT Mandi', 'IIT indore', 'IIT Hydrabad', 'IIT Jodhpur', 'IIT Gandhinagar', 'IIT Patna', 'IIT Ropar', 'IIT (BHU) Varanasi', 'ISM Dhanbad']

In [9]:
virus = app.copy()
virus += [296]
for i in range(len(virus)-1):
  virus[i] = virus[i+1] - virus[i]
  
del virus[-1]
print(len(virus) , virus)

17 [21, 18, 43, 17, 34, 22, 16, 9, 8, 8, 12, 10, 9, 9, 8, 29, 23]

In [10]:
col_name = []
for i in range(len(collg)):
  col_name+=[collg[i]]*virus[i]
print(len(col_name))

296

In [0]:
data.insert(0,'College_Name',col_name)

In [12]:
print(data.shape)
data.head()

(296, 10)

  College_Name                  col_0  ...       col_7       col_8
0   IIT Bombay             IIT Bombay  ...  Unnamed: 7  Unnamed: 8
1   IIT Bombay           Branch Name   ...          ST         NaN
2   IIT Bombay                    NaN  ...        Open       Close
3   IIT Bombay  Aerospace Engineering  ...         154         266
4   IIT Bombay   Chemical Engineering  ...         158         315

[5 rows x 10 columns]

In [0]:
data.rename(columns = {"col_0": "BRANCH_NAME" , "col_1":"GENERAL_OPEN" , "col_2":"GENERAL_CLOSE" , "col_3":"OBC_OPEN" ,"col_4":"OBC_CLOSE" , "col_5":"SC_OPEN"
                      ,"col_6":"SC_CLOSE", "col_7": "ST_OPEN" , "col_8":"ST_CLOSE"}  , inplace=True)

In [0]:
data = data.dropna(how='any',axis=0)

In [0]:
data.drop(0 , axis =0 , inplace =True)

In [0]:
data.reset_index(inplace=True)
data.drop('index' , axis =1 , inplace =True)

In [17]:
print(data.shape)
data.head(8)

(212, 10)

  College_Name             BRANCH_NAME GENERAL_OPEN  ... SC_CLOSE ST_OPEN ST_CLOSE
0   IIT Bombay   Aerospace Engineering          405  ...      334     154      266
1   IIT Bombay    Chemical Engineering          727  ...      544     158      315
2   IIT Bombay       Civil Engineering          400  ...      372      69       96
3   IIT Bombay    Computer Engineering            1  ...       19       3       21
4   IIT Bombay  Electrical Engineering            7  ...       64       2       18
5   IIT Bombay     Engineering Physics          206  ...      490     151      426
6   IIT Bombay  Mechanical Engineering           24  ...      105      22       52
7   IIT Bombay   Metallurgical Science         1243  ...      982     239      522

[8 rows x 10 columns]

In [0]:
df = data.copy()

In [19]:
#here we have 103 unique Branches 
df['BRANCH_NAME'].nunique()

103

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 212 entries, 0 to 211
Data columns (total 10 columns):
College_Name     212 non-null object
BRANCH_NAME      212 non-null object
GENERAL_OPEN     212 non-null object
GENERAL_CLOSE    212 non-null object
OBC_OPEN         212 non-null object
OBC_CLOSE        212 non-null object
SC_OPEN          212 non-null object
SC_CLOSE         212 non-null object
ST_OPEN          212 non-null object
ST_CLOSE         212 non-null object
dtypes: object(10)
memory usage: 16.6+ KB

In [21]:
df['GENERAL_OPEN'] = df['GENERAL_OPEN'].astype(int) 
df['GENERAL_CLOSE'] = df['GENERAL_CLOSE'].astype(int) 
df['OBC_OPEN'] = df['OBC_OPEN'].astype(int) 

df['OBC_CLOSE'] = df['OBC_CLOSE'].astype(int) 
df['SC_OPEN'] = df['SC_OPEN'].astype(int) 
df['SC_CLOSE'] = df['SC_CLOSE'].astype(int) 
df['ST_OPEN'] = df['ST_OPEN'].astype(int) 
df['ST_CLOSE'] = df['ST_CLOSE'].astype(int) 
print(df.shape)
df.info()

(212, 10)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 212 entries, 0 to 211
Data columns (total 10 columns):
College_Name     212 non-null object
BRANCH_NAME      212 non-null object
GENERAL_OPEN     212 non-null int64
GENERAL_CLOSE    212 non-null int64
OBC_OPEN         212 non-null int64
OBC_CLOSE        212 non-null int64
SC_OPEN          212 non-null int64
SC_CLOSE         212 non-null int64
ST_OPEN          212 non-null int64
ST_CLOSE         212 non-null int64
dtypes: int64(8), object(2)
memory usage: 16.6+ KB

In [22]:
df.describe()

       GENERAL_OPEN  GENERAL_CLOSE  ...     ST_OPEN    ST_CLOSE
count    212.000000     212.000000  ...  212.000000  212.000000
mean    2745.080189    3724.514151  ...  359.731132  426.816038
std     1888.583859    2070.029396  ...  252.970201  257.754373
min        1.000000      59.000000  ...    0.000000    0.000000
25%     1116.500000    2085.000000  ...  150.750000  244.250000
50%     2657.500000    3729.500000  ...  339.500000  417.500000
75%     4130.750000    5550.000000  ...  577.250000  627.000000
max     7076.000000    7419.000000  ...  854.000000  856.000000

[8 rows x 8 columns]

In [23]:
df.head(8)

  College_Name             BRANCH_NAME  ...  ST_OPEN  ST_CLOSE
0   IIT Bombay   Aerospace Engineering  ...      154       266
1   IIT Bombay    Chemical Engineering  ...      158       315
2   IIT Bombay       Civil Engineering  ...       69        96
3   IIT Bombay    Computer Engineering  ...        3        21
4   IIT Bombay  Electrical Engineering  ...        2        18
5   IIT Bombay     Engineering Physics  ...      151       426
6   IIT Bombay  Mechanical Engineering  ...       22        52
7   IIT Bombay   Metallurgical Science  ...      239       522

[8 rows x 10 columns]

#Till Now Everythng is FineðŸŽ‰âœ”

#Now move on to the another part (design New table using same records) âœˆ

In [76]:
df1 = df.copy()
df1.rename(columns = {"BRANCH_NAME":"DEPARTMENT" , "College_Name":"INSTITUTE_NAME"} ,inplace=True)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 212 entries, 0 to 211
Data columns (total 10 columns):
INSTITUTE_NAME    212 non-null object
DEPARTMENT        212 non-null object
GENERAL_OPEN      212 non-null int64
GENERAL_CLOSE     212 non-null int64
OBC_OPEN          212 non-null int64
OBC_CLOSE         212 non-null int64
SC_OPEN           212 non-null int64
SC_CLOSE          212 non-null int64
ST_OPEN           212 non-null int64
ST_CLOSE          212 non-null int64
dtypes: int64(8), object(2)
memory usage: 16.6+ KB

In [77]:
df1.head(8)

  INSTITUTE_NAME              DEPARTMENT  ...  ST_OPEN  ST_CLOSE
0     IIT Bombay   Aerospace Engineering  ...      154       266
1     IIT Bombay    Chemical Engineering  ...      158       315
2     IIT Bombay       Civil Engineering  ...       69        96
3     IIT Bombay    Computer Engineering  ...        3        21
4     IIT Bombay  Electrical Engineering  ...        2        18
5     IIT Bombay     Engineering Physics  ...      151       426
6     IIT Bombay  Mechanical Engineering  ...       22        52
7     IIT Bombay   Metallurgical Science  ...      239       522

[8 rows x 10 columns]

#1.) Based on openting Rank âœ”âœŒ

In [0]:
df1.drop(['GENERAL_CLOSE' ,'OBC_CLOSE' , 'SC_CLOSE' ,  'ST_CLOSE'] , axis=1 , inplace= True)

In [0]:
# df1['College_Name'] = df1['College_Name'].apply(lambda x:','+str(x))
# df1.head()

In [0]:
# gen = list(df1['GENERAL_OPEN']) 
# obc = list(df1['OBC_OPEN']) 
# sc = list(df1['SC_OPEN']) 
# st = list(df1['ST_OPEN']) 
# second = list(df1['College_Name'])


# # print([x + y for x, y in zip(gen, second)])
# # print([x + y for x, y in zip(obc, second)])
# # print([x + y for x, y in zip(sc, second)])
# # print([x + y for x, y in zip(st, second)])


# df1['GENERAL'] = [x + y for x, y in zip(gen, second)]
# df1['OBC'] = [x + y for x, y in zip(obc, second)]
# df1['SC'] = [x + y for x, y in zip(sc, second)]
# df1['ST'] = [x + y for x, y in zip(st, second)]
# df1.drop(['GENERAL_OPEN','OBC_OPEN' , 'SC_OPEN' ,'ST_OPEN' ,'College_Name' ] , axis =1 , inplace =True)

In [79]:
print(df1.shape)
df1.head()

(212, 6)

  INSTITUTE_NAME              DEPARTMENT  ...  SC_OPEN  ST_OPEN
0     IIT Bombay   Aerospace Engineering  ...       46      154
1     IIT Bombay    Chemical Engineering  ...      151      158
2     IIT Bombay       Civil Engineering  ...      107       69
3     IIT Bombay    Computer Engineering  ...        2        3
4     IIT Bombay  Electrical Engineering  ...       12        2

[5 rows x 6 columns]

In [0]:
#For General
dfa = df1.iloc[: , :3]
cat1 = []
for i in range(len(dfa)):
  cat1.append('GENERAL')
dfa['CATEGORY'] =cat1
dfa.rename(columns = {"GENERAL_OPEN":"RANK_PREDICTOR"} , inplace=True)

In [0]:
#For OBC
dfb = df1.iloc[: , [0,1,3]]
cat2 = []
for i in range(len(dfb)):
  cat2.append('OBC')
dfb['CATEGORY'] =cat2
dfb.rename(columns = {"OBC_OPEN":"RANK_PREDICTOR"} , inplace=True)

In [0]:
#For SC
dfc = df1.iloc[: , [0,1,4]]
cat3 = []
for i in range(len(dfc)):
  cat3.append('SC')
dfc['CATEGORY'] =cat3
dfc.rename(columns = {"SC_OPEN":"RANK_PREDICTOR"} , inplace=True)

In [0]:
#For ST
dfd = df1.iloc[: , [0,1,5]]
cat4 = []
for i in range(len(dfd)):
  cat4.append('ST')
dfd['CATEGORY'] =cat4
dfd.rename(columns = {"ST_OPEN":"RANK_PREDICTOR"} , inplace=True)

In [168]:
print(dfa.shape)
dfa.head()

(212, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             405  GENERAL
1     IIT Bombay    Chemical Engineering             727  GENERAL
2     IIT Bombay       Civil Engineering             400  GENERAL
3     IIT Bombay    Computer Engineering               1  GENERAL
4     IIT Bombay  Electrical Engineering               7  GENERAL

In [169]:
print(dfb.shape)
dfb.head()

(212, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             256      OBC
1     IIT Bombay    Chemical Engineering             427      OBC
2     IIT Bombay       Civil Engineering             379      OBC
3     IIT Bombay    Computer Engineering               8      OBC
4     IIT Bombay  Electrical Engineering              34      OBC

In [170]:
print(dfc.shape)
dfc.head()

(212, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering              46       SC
1     IIT Bombay    Chemical Engineering             151       SC
2     IIT Bombay       Civil Engineering             107       SC
3     IIT Bombay    Computer Engineering               2       SC
4     IIT Bombay  Electrical Engineering              12       SC

In [171]:
print(dfd.shape)
dfd.head()

(212, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             154       ST
1     IIT Bombay    Chemical Engineering             158       ST
2     IIT Bombay       Civil Engineering              69       ST
3     IIT Bombay    Computer Engineering               3       ST
4     IIT Bombay  Electrical Engineering               2       ST

In [172]:
table = pd.concat([dfa ,dfb,dfc, dfd] , ignore_index =True)
print(table.shape)

(848, 4)

In [173]:
table.head()

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             405  GENERAL
1     IIT Bombay    Chemical Engineering             727  GENERAL
2     IIT Bombay       Civil Engineering             400  GENERAL
3     IIT Bombay    Computer Engineering               1  GENERAL
4     IIT Bombay  Electrical Engineering               7  GENERAL

###Find Duplicate Rows

In [174]:
table[table.duplicated(keep=False)]

         INSTITUTE_NAME     DEPARTMENT  RANK_PREDICTOR CATEGORY
813  IIT (BHU) Varanasi  Pharmaceutics               0       ST
827  IIT (BHU) Varanasi  Pharmaceutics               0       ST

In [175]:
table.drop(813 , axis =0 , inplace =True)
print(table.shape)
table.head()

(847, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             405  GENERAL
1     IIT Bombay    Chemical Engineering             727  GENERAL
2     IIT Bombay       Civil Engineering             400  GENERAL
3     IIT Bombay    Computer Engineering               1  GENERAL
4     IIT Bombay  Electrical Engineering               7  GENERAL

In [0]:
table.reset_index(inplace=True)
table.drop('index' , axis = 1 ,inplace=True)

In [177]:
print(table.shape)

(847, 4)

In [178]:
table.head()

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering             405  GENERAL
1     IIT Bombay    Chemical Engineering             727  GENERAL
2     IIT Bombay       Civil Engineering             400  GENERAL
3     IIT Bombay    Computer Engineering               1  GENERAL
4     IIT Bombay  Electrical Engineering               7  GENERAL

In [0]:
fin = table.sort_values("RANK_PREDICTOR")
fin.reset_index(inplace=True)
fin.drop('index' , axis = 1 ,inplace=True)

In [180]:
print(fin.shape)
fin.to_csv('Open.csv' , index = False)

(847, 4)

In [186]:
fin[20:30]

   INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
20      IIT Delhi    Computer Engineering               4  GENERAL
21      IIT Delhi    Computer Engineering               5       ST
22     IIT Bombay  Electrical Engineering               7  GENERAL
23      IIT Delhi  Mechanical Engineering               8       ST
24     IIT Bombay    Computer Engineering               8      OBC
25     IIT Madras  Electrical Engineering               9       ST
26      IIT Delhi  Electrical Engineering              10       ST
27      IIT Delhi    Computer Engineering              10       SC
28     IIT Bombay  Electrical Engineering              12       SC
29     IIT Bombay     Engineering Physics              15       SC

In [187]:
rank = int(input("Enter the Opening rank : "))

Enter the Opening rank : 0

In [181]:
cat = input("Enter the Category : ")

Enter the Category : ST

In [182]:
print('NUmber of  the college with Departments based on rank : ' , end=' ')
print(fin[(fin['RANK_PREDICTOR']==rank) & (fin['CATEGORY']==cat)].shape[0])

print('Display all of  the college with Departments based on rank : ' , end=' ')
DEP = fin[(fin['RANK_PREDICTOR']==rank) & (fin['CATEGORY']==cat)].iloc[: , :2]
DEP

NUmber of  the college with Departments based on rank :  15
Display all of  the college with Departments based on rank :

        INSTITUTE_NAME                              DEPARTMENT
0          ISM Dhanbad                      Applied Geophysics
1           IIT Madras                     Civil Engineering *
2          IIT Roorkee                Pulp & Paper Engineering
3          IIT Roorkee                            Architecture
4          IIT Roorkee                  Geophysical Technology
5           IIT Kanpur                               Chemistry
6        IIT Kharagpur                  Exploration Geophysics
7        IIT Kharagpur                               Economics
8        IIT Kharagpur                         Applied Geology
9           IIT Madras                Electrical Engineering *
10  IIT (BHU) Varanasi                    Industrial Chemistry
11  IIT (BHU) Varanasi                           Pharmaceutics
12          IIT Madras  Naval Architecture & Ocean Engineering
13         ISM Dhanbad                 Mathematics & Computing
14         ISM Dhanbad                         Applied Geology

#EXAMPLE -1: Department Wise

In [183]:
order = input("Enter the order : ")
output = DEP.groupby(order).sum()
output.reset_index(inplace =True)
print(output.shape)
output

Enter the order : DEPARTMENT
(14, 2)

                                DEPARTMENT            INSTITUTE_NAME
0                          Applied Geology  IIT KharagpurISM Dhanbad
1                       Applied Geophysics               ISM Dhanbad
2                             Architecture               IIT Roorkee
3                                Chemistry                IIT Kanpur
4                      Civil Engineering *                IIT Madras
5                                Economics             IIT Kharagpur
6                 Electrical Engineering *                IIT Madras
7                   Exploration Geophysics             IIT Kharagpur
8                   Geophysical Technology               IIT Roorkee
9                     Industrial Chemistry        IIT (BHU) Varanasi
10                 Mathematics & Computing               ISM Dhanbad
11  Naval Architecture & Ocean Engineering                IIT Madras
12                           Pharmaceutics        IIT (BHU) Varanasi
13                Pulp & Paper Engineering               IIT Roorkee

# EXAMPLE : 2- Institute Wise

In [184]:
order = input("Enter the order : ")
output = DEP.groupby(order).sum()
output.reset_index(inplace =True)
print(output.shape)
output

Enter the order : INSTITUTE_NAME
(6, 2)

       INSTITUTE_NAME                                         DEPARTMENT
0  IIT (BHU) Varanasi                  Industrial ChemistryPharmaceutics
1          IIT Kanpur                                          Chemistry
2       IIT Kharagpur     Exploration GeophysicsEconomicsApplied Geology
3          IIT Madras  Civil Engineering *Electrical Engineering *Nav...
4         IIT Roorkee  Pulp & Paper EngineeringArchitectureGeophysica...
5         ISM Dhanbad  Applied GeophysicsMathematics & ComputingAppli...


Hurray !!! One Task is Complete
---



---

#2.) Based on Closing Rank âœ”âœŒ

In [118]:
df2 = df.copy()
df2.rename(columns = {"BRANCH_NAME":"DEPARTMENT" , "College_Name":"INSTITUTE_NAME"} ,inplace=True)
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 212 entries, 0 to 211
Data columns (total 10 columns):
INSTITUTE_NAME    212 non-null object
DEPARTMENT        212 non-null object
GENERAL_OPEN      212 non-null int64
GENERAL_CLOSE     212 non-null int64
OBC_OPEN          212 non-null int64
OBC_CLOSE         212 non-null int64
SC_OPEN           212 non-null int64
SC_CLOSE          212 non-null int64
ST_OPEN           212 non-null int64
ST_CLOSE          212 non-null int64
dtypes: int64(8), object(2)
memory usage: 16.6+ KB

In [0]:
df2.drop(['GENERAL_OPEN' ,'OBC_OPEN' , 'SC_OPEN' ,  'ST_OPEN'] , axis=1 , inplace= True)

In [120]:
df2.head()

  INSTITUTE_NAME              DEPARTMENT  ...  SC_CLOSE  ST_CLOSE
0     IIT Bombay   Aerospace Engineering  ...       334       266
1     IIT Bombay    Chemical Engineering  ...       544       315
2     IIT Bombay       Civil Engineering  ...       372        96
3     IIT Bombay    Computer Engineering  ...        19        21
4     IIT Bombay  Electrical Engineering  ...        64        18

[5 rows x 6 columns]

In [0]:
#For General
dfa = df2.iloc[: , :3]
cat1 = []
for i in range(len(dfa)):
  cat1.append('GENERAL')
dfa['CATEGORY'] =cat1
dfa.rename(columns = {"GENERAL_CLOSE":"RANK_PREDICTOR"} , inplace=True)

#For OBC
dfb = df2.iloc[: , [0,1,3]]
cat2 = []
for i in range(len(dfb)):
  cat2.append('OBC')
dfb['CATEGORY'] =cat2
dfb.rename(columns = {"OBC_CLOSE":"RANK_PREDICTOR"} , inplace=True)

#For SC
dfc = df2.iloc[: , [0,1,4]]
cat3 = []
for i in range(len(dfc)):
  cat3.append('SC')
dfc['CATEGORY'] =cat3
dfc.rename(columns = {"SC_CLOSE":"RANK_PREDICTOR"} , inplace=True)

#For ST
dfd = df2.iloc[: , [0,1,5]]
cat4 = []
for i in range(len(dfd)):
  cat4.append('ST')
dfd['CATEGORY'] =cat4
dfd.rename(columns = {"ST_CLOSE":"RANK_PREDICTOR"} , inplace=True)

In [122]:
table = pd.concat([dfa ,dfb,dfc, dfd] , ignore_index =True)
print(table.shape)

(848, 4)

In [124]:
table.head()

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering            1674  GENERAL
1     IIT Bombay    Chemical Engineering            1240  GENERAL
2     IIT Bombay       Civil Engineering            1688  GENERAL
3     IIT Bombay    Computer Engineering              59  GENERAL
4     IIT Bombay  Electrical Engineering             135  GENERAL

In [123]:
table[table.duplicated(keep=False)]

         INSTITUTE_NAME     DEPARTMENT  RANK_PREDICTOR CATEGORY
813  IIT (BHU) Varanasi  Pharmaceutics               0       ST
827  IIT (BHU) Varanasi  Pharmaceutics               0       ST

In [125]:
table.drop(813 , axis =0 , inplace =True)
print(table.shape)
table.head()

(847, 4)

  INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
0     IIT Bombay   Aerospace Engineering            1674  GENERAL
1     IIT Bombay    Chemical Engineering            1240  GENERAL
2     IIT Bombay       Civil Engineering            1688  GENERAL
3     IIT Bombay    Computer Engineering              59  GENERAL
4     IIT Bombay  Electrical Engineering             135  GENERAL

In [0]:
table.reset_index(inplace=True)
table.drop('index' , axis = 1 ,inplace=True)

In [127]:
fin = table.sort_values("RANK_PREDICTOR")
fin.reset_index(inplace=True)
fin.drop('index' , axis = 1 ,inplace=True)
print(fin.shape)

(847, 4)

In [130]:
fin[20:30]

   INSTITUTE_NAME              DEPARTMENT  RANK_PREDICTOR CATEGORY
20      IIT Delhi    Computer Engineering              36       SC
21     IIT Bombay    Computer Engineering              38      OBC
22      IIT Delhi  Electrical Engineering              39       ST
23     IIT Madras    Computer Engineering              48       SC
24     IIT Bombay  Mechanical Engineering              52       ST
25      IIT Delhi       Civil Engineering              57       ST
26     IIT Bombay    Computer Engineering              59  GENERAL
27      IIT Delhi  Mechanical Engineering              63       ST
28     IIT Bombay  Electrical Engineering              64       SC
29      IIT Delhi    Computer Engineering              69      OBC

In [0]:
fin.to_csv('Close.csv' , index = False)



---



---


#FINALLY WE ARE HERE .........ðŸŽ‰
#Perform Last Activity 
# Search the college & Branch based on Rank & Category

In [150]:
rank = int(input("Enter the closing rank : "))

Enter the closing rank : 0

In [145]:
cat = input("Enter the Category : ")

Enter the Category : ST

In [149]:
print('NUmber of  the college with Departments based on rank : ' , end=' ')
print(fin[(fin['RANK_PREDICTOR']==rank) & (fin['CATEGORY']==cat)].shape[0])

print('Display all of  the college with Departments based on rank : ' , end=' ')
DEP = fin[(fin['RANK_PREDICTOR']==rank) & (fin['CATEGORY']==cat)].iloc[: , :2]
DEP

NUmber of  the college with Departments based on rank :  15
Display all of  the college with Departments based on rank :

        INSTITUTE_NAME                              DEPARTMENT
0          ISM Dhanbad                      Applied Geophysics
1          IIT Roorkee                  Geophysical Technology
2          IIT Roorkee                            Architecture
3          IIT Roorkee                Pulp & Paper Engineering
4           IIT Madras  Naval Architecture & Ocean Engineering
5           IIT Madras                Electrical Engineering *
6           IIT Madras                     Civil Engineering *
7           IIT Kanpur                               Chemistry
8   IIT (BHU) Varanasi                    Industrial Chemistry
9   IIT (BHU) Varanasi                           Pharmaceutics
10       IIT Kharagpur                  Exploration Geophysics
11       IIT Kharagpur                               Economics
12       IIT Kharagpur                         Applied Geology
13         ISM Dhanbad                         Applied Geology
14         ISM Dhanbad                 Mathematics & Computing

#EXAMPLE -1: Department Wise

In [148]:
order = input("Enter the order : ")

Enter the order : DEPARTMENT

In [160]:
output = DEP.groupby(order).sum()
output.reset_index(inplace =True)
print(output.shape)
output

(14, 2)

                                DEPARTMENT            INSTITUTE_NAME
0                          Applied Geology  IIT KharagpurISM Dhanbad
1                       Applied Geophysics               ISM Dhanbad
2                             Architecture               IIT Roorkee
3                                Chemistry                IIT Kanpur
4                      Civil Engineering *                IIT Madras
5                                Economics             IIT Kharagpur
6                 Electrical Engineering *                IIT Madras
7                   Exploration Geophysics             IIT Kharagpur
8                   Geophysical Technology               IIT Roorkee
9                     Industrial Chemistry        IIT (BHU) Varanasi
10                 Mathematics & Computing               ISM Dhanbad
11  Naval Architecture & Ocean Engineering                IIT Madras
12                           Pharmaceutics        IIT (BHU) Varanasi
13                Pulp & Paper Engineering               IIT Roorkee

# EXAMPLE : 2- Institute Wise

In [161]:
order = input("Enter the order : ")

Enter the order : INSTITUTE_NAME

In [162]:
output = DEP.groupby(order).sum()
output.reset_index(inplace =True)
print(output.shape)
output

(6, 2)

       INSTITUTE_NAME                                         DEPARTMENT
0  IIT (BHU) Varanasi                  Industrial ChemistryPharmaceutics
1          IIT Kanpur                                          Chemistry
2       IIT Kharagpur     Exploration GeophysicsEconomicsApplied Geology
3          IIT Madras  Naval Architecture & Ocean EngineeringElectric...
4         IIT Roorkee  Geophysical TechnologyArchitecturePulp & Paper...
5         ISM Dhanbad  Applied GeophysicsApplied GeologyMathematics &...


END 
---

---



---



---





---



---



---



---

#other/Rough task

In [30]:
first = [1,2,3]
second = [4,5,6]
[x + y for x, y in zip(first, second)]

[5, 7, 9]

In [32]:
lists_of_lists = [[1, 2, 3], [4, 5, 6]]
print(*lists_of_lists)
print(zip(*lists_of_lists))
[sum(x) for x in zip(*lists_of_lists)]

[1, 2, 3] [4, 5, 6]
<zip object at 0x7f1598ad4248>

[5, 7, 9]

In [33]:
first = ['1','2','3']
second = ['a','b','c']
[x + y for x, y in zip(first, second)]

['1a', '2b', '3c']